In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([10, 20, 30, 40, 50])
obj

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
print("Values: " + str(obj.values))
print("Index: " + str(obj.index))

Values: [10 20 30 40 50]
Index: RangeIndex(start=0, stop=5, step=1)

In [4]:
obj2 = pd.Series([25, 18, 15, 10], index=["first", "second", "third", "fourth"])
obj2

first     25
second    18
third     15
fourth    10
dtype: int64

In [5]:
print("Values: " + str(obj2.values))
print("Index: " + str(obj2.index))
print(obj2['second'])
obj2['second'] = 19
obj2['second']

Values: [25 18 15 10]
Index: Index(['first', 'second', 'third', 'fourth'], dtype='object')
18

19

In [6]:
obj2[obj2 > 15]
'first' in obj2
'last' in obj2

False

In [7]:
data = {'Ohio':35000, 'Texas':71000, 'Oregon':16000}
obj3 = pd.Series(data)
obj3

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [8]:
states = ["California", "Texas", "Oregon"]
obj4 = pd.Series(data, index=states)
obj4

California        NaN
Texas         71000.0
Oregon        16000.0
dtype: float64

In [9]:
obj4.isnull()

California     True
Texas         False
Oregon        False
dtype: bool

In [10]:
obj3 + obj4

California         NaN
Ohio               NaN
Oregon         32000.0
Texas         142000.0
dtype: float64

In [11]:
data = {'state': ['Ohio', 'Texas', 'Nevada'],
        'year': [2000, 2001, 2002],
        'pop': [1.6, 2.0, 3.0]}

dataFrame = pd.DataFrame(data, columns=['year', 'pop', 'state', 'debt'],
                         index=['one', 'two', 'three'])
dataFrame

       year  pop   state debt
one    2000  1.6    Ohio  NaN
two    2001  2.0   Texas  NaN
three  2002  3.0  Nevada  NaN

In [12]:
stateSeries = dataFrame['state']
stateSeries

one        Ohio
two       Texas
three    Nevada
Name: state, dtype: object

In [13]:
dataFrame['debt'] = np.arange(3)
dataFrame

       year  pop   state  debt
one    2000  1.6    Ohio     0
two    2001  2.0   Texas     1
three  2002  3.0  Nevada     2

In [14]:
dataFrame['eastern'] = dataFrame.state == 'Ohio'
dataFrame

       year  pop   state  debt  eastern
one    2000  1.6    Ohio     0     True
two    2001  2.0   Texas     1    False
three  2002  3.0  Nevada     2    False

In [15]:
dataFrame.values

array([[2000, 1.6, 'Ohio', 0, True],
       [2001, 2.0, 'Texas', 1, False],
       [2002, 3.0, 'Nevada', 2, False]], dtype=object)

In [16]:
obj = pd.Series([4.5, 6.8, 9.0, 4.3, 1.0], index=['d', 'e', 'f', 'g', 'h'])
obj

d    4.5
e    6.8
f    9.0
g    4.3
h    1.0
dtype: float64

In [19]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e', 'f'], fill_value=0)
obj2

a    0.0
b    0.0
c    0.0
d    4.5
e    6.8
f    9.0
dtype: float64

In [20]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'b', 'c'], columns=['Ohio', 'Texas', 'Nevada'])
frame

   Ohio  Texas  Nevada
a     0      1       2
b     3      4       5
c     6      7       8

In [21]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  Nevada
a   0.0    1.0     2.0
b   3.0    4.0     5.0
c   6.0    7.0     8.0
d   NaN    NaN     NaN

In [22]:
states = ['Ohio', 'Missouri', 'Texas', 'Nevada']
frame2 = frame.reindex(columns=states)
frame2

   Ohio  Missouri  Texas  Nevada
a     0       NaN      1       2
b     3       NaN      4       5
c     6       NaN      7       8

In [23]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [24]:
obj2 = obj.drop('c')
obj2

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Missouri', 'Ohio', 'Colorado', 'Texas'], columns=['one', 'two', 'three', 'four'])
frame

          one  two  three  four
Missouri    0    1      2     3
Ohio        4    5      6     7
Colorado    8    9     10    11
Texas      12   13     14    15

In [26]:
frame2 = frame.drop('Colorado')
frame2

          one  two  three  four
Missouri    0    1      2     3
Ohio        4    5      6     7
Texas      12   13     14    15

In [29]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj[['b', 'c', 'd']]

b    1.0
c    2.0
d    3.0
dtype: float64

In [30]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Texas', 'Colorato', 'Michigan'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Texas       4    5      6     7
Colorato    8    9     10    11
Michigan   12   13     14    15

In [35]:
data['two']
data[data % 2 == 0]
data[data['one'] > 3]
data < 5

            one    two  three   four
Ohio       True   True   True   True
Texas      True  False  False  False
Colorato  False  False  False  False
Michigan  False  False  False  False

In [40]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Ohio', 'Cleveland', 'Michigan', 'Texas'])
np.abs(frame)

                  b         d         e
Ohio       0.039897  1.063882  0.016950
Cleveland  0.371844  0.211395  0.428478
Michigan   0.010964  1.117263  0.337752
Texas      0.341139  1.904517  0.972259

In [42]:
f = lambda x: x.max() - x.min()
frame.apply(f, axis=0)

b    0.382808
d    2.115912
e    1.400738
dtype: float64